

# 1行 : 1要素 : str
# ==========================================================================================================================

# 形式
# xxxx

# コード
S = input()  # type(S) => <class 'str'>

# 戻り値
# "xxxx"


# 1行 : 1要素 : int
# ==========================================================================================================================

# 形式
# 1200

# コード
N = int(input())  # type(N) => <class 'int'>

# 戻り値
# 1200


# 1行 : 1要素 : float
# ==========================================================================================================================

# 形式
# 3.14

# コード
F = float(input())  # type(x) => <class 'float'>

# 戻り値
# 3.14








# 1行 : 複数要素 : 空白区切り : str
# ==========================================================================================================================

# 形式: 空白区切りで３つの文字列の場合
# xxxxxxx yyy zzzzz

S = input().split() # type(S) => <class 'list'>

# 戻り値
# ["xxxxxxx", "yyy", "zzzzz"]


# 1行 : 複数要素 : 空白区切り : int
# ==========================================================================================================================

# 形式: 空白区切りで３つの文字列の場合
# 454 8158 1566

N = list(map(int, input().split())) # type(S) => <class 'list'>

# 戻り値
# [454, 8158, 1566]







# 1行 : 複数要素 : カンマ区切り :str
# ==========================================================================================================================

# 形式
# jaosdfk, kfasodf, oiasdjfaod

# コード
S = input().split(",")

# 戻り値
# ["jaosdfk", "kfasodf", "oiasdjfaod"]


# 1行 : 複数要素 : カンマ区切り :int
# ==========================================================================================================================

# 形式
# 1564, 64516, 81851

# コード
l = list(map(int ,input().split(',')))

# 戻り値
# [1564, 64516, 81851]






# 「1行に複数」を「別々で」 : int
# ==========================================================================================================================

# 形式
# A B

# コード１
A, B = map(int, input().split())

# 戻り値 A
# 5
# 戻り値 B
# 10









# 複数の整数 (N無し)
# ==========================================================================================================================
# カンマ忘れに注意です。

# 形式
# d1
# ・
# ・
# ・
# dN

# Sample
# 4
# 10
# 8
# 8
# 6

*L, = map(int, open(0).read().split())  # カンマ(,)が必要; 利用時に「*」と「,」はいりません

# 戻り値 L
# [4, 10, 8, 8, 6]


# 複数の整数
# ==========================================================================================================================
# 変数の前に * をつけます。

# 形式
# I
# d1
# ・
# ・
# ・
# dN

# Sample
# 4
# 10
# 8
# 8
# 6

# コード
N, *L = map(int, open(0).read().split())  

# 出力(N)
# 4

# 出力(L)
# [10,8,8,6]









# 「1行に複数」を「リストとして」 : int
# ==========================================================================================================================

# 形式 => N が A の要素数
# N
# A1 A2 … AN

# コード
I, *N = map(int, open(0).read().split()) # => Aを使いたいときはそのまま print(A) として使う

# 出力(N)
# 4
# 出力(A)
# [5,6,8,10]





# 「1行に複数」を「ソートしておきたい」 : int
# ==========================================================================================================================

# 形式 => N が A の要素数
# N
# A1 A2 … AN

# コード
N = int(input())
A = sorted(int(x) for x in input().split())

# # コード４ 独自
# N,*A=map(int,open(0).read().split())
# for i in range(1,N+1):A[:i]=sorted(A[:i])
# print(A)

# 出力(N)
# 4
# 出力(A)
# [5, 6, 8, 10]








# 「複数行に1つ」を「リストとして」- 行列、グリッド : int
# ==========================================================================================================================

# 形式 => H が S の要素数
# H W
# S1
# ・
# ・
# ・
# SH

# コード
H, W = map(int, input().split())
S = [input() for _ in [0] * H]

# 出力(H)
# 5
# 出力(W)
# 200
# 出力(S)
# [100,100,500,500,500]








# 最初にすべて読み込む必要がある場合 - 事前に各リストを用意しておく : int
# ==========================================================================================================================

# 形式 => N が t の要素数
# N
# t1 x1 y1
# t2 x2 y2
# ・
# ・
# ・
# tN xN yN

# Sample
# 6
# 3 1 2
# 4 2 2
# 5 4 7
# 9 3 8
# 1 9 8
# 7 7 2

# コード
N = int(input())
t = [0] * N
x = [0] * N
y = [0] * N
for i in range(N):
    t[i], x[i], y[i] = map(int, input().split())
    
    
# 出力(N)
# 6
# 出力(t)
# [3,4,5,9,1,7]
# 出力(x)
# [1,2,4,3,9,7]
# 出力(y)
# [2,2,7,8,8,2]









# 1行ずつ処理 - for 文を使うだけ : int
# ==========================================================================================================================

# 形式 => M が a の要素数
# N M
# a1 b1
# ・
# ・
# ・
# aM bM

# Sample
# 4 6 => 縦の要素数(a)が6個
# 1 2
# 2 3
# 1 4
# 1 2
# 2 3
# 15 4

# コード
N, M = map(int, input().split())
for _ in range(M):
    a, b = map(int, input().split())
    # 処理
    
    # 出力(a)
    # 1
    # 2
    # 1
    # 1
    # 2
    # 1
    # 出力(b)
    # 2
    # 3
    # 4
    # 2
    # 3
    # 4
# ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ 
# a と b に値を代入しているわけではないので、forの外で、print(a)としたら、最後の要素(今回では15)になります。
# a = [1,2,1,1,2,15]としたい場合は、事前にリストを作ってそこに代入する方法をとってください。(サンプル有)
# ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ ※ 
# 出力(N)
# 4
# 出力(M)
# 6









# 特定の文字列を読み込むまで読み込み続ける : int   
# ==========================================================================================================================

# 形式 => "-1"が入力の終わりを示す場合
# a1
# a2
# ・
# ・
# ・
# 5


# Sample
# 4
# 1
# 2
# 1
# 5
# 2
# 1


# コード例
for e in iter(input, '5'):  # 「'5'」の部分を問題に応じて変更します。※ inputで取得した値はintも必ずstrとして扱われます。
    # 処理
    print(e)
    
    # 出力(a)
    # 4
    # 1
    # 2
    # 1
    # 5 => 今回は-1まで実行だったので、-1が出たので処理が終了
  
  
  
  
  
  
# 「決まった数」、「決ってない縦横」 : int
# ==========================================================================================================================

# 形式1
# 10 20 50 40

# 形式2
# 10
# 20
# 50
# 40

# コード例
A, B, C, X = map(int, open(0).read().split())

# 出力(A)
# 10
# 出力(B)
# 20
# 出力(C)
# 50
# 出力(D)
# 30

# 形式1 にも 形式2 にも対応することができます。
